lighttransport/gemm/cuda/sam3d/test_cuda_sam3d.c
/* test_cuda_sam3d — CLI for the CUDA SAM 3D Objects runner.
 *
 * Phase 7a: end-to-end image → splat.ply. Mirrors the CPU runner CLI in
 * cpu/sam3d/test_sam3d.c so a single fujisan.jpg + pointmap.npy
 * invocation drives the full six-stage CUDA pipeline.
 *
 * Usage:
 *   test_cuda_sam3d [--safetensors-dir DIR] [--pipeline-yaml YAML]
 *                   <image.png> <mask.png>
 *                   [--pointmap pmap.npy] [--slat-ref <dir>]
 *                   [--seed N] [--steps N] [--slat-steps N]
 *                   [--cfg F] [-o splat.ply]
 *                   [--mesh-out mesh.obj|mesh.ply|mesh.glb]
 *                   [--mesh-source occupancy|slat]
 *                   [--mesh-decoder mesh.safetensors]
 *                   [--mesh-iso F] [--mesh-only] [--mesh-threads N]
 *                   [--mesh-texture-size N]
 *                   [--mesh-texture-mode xatlas|grid]
 *                   [--mesh-texture-color auto|decoder|image]
 *                   [--moge] [--moge-out pmap.npy]
 *                   [--moge-python PY] [--moge-script SCRIPT]
 *                   [--moge-model MODEL] [--moge-device cpu|cuda]
 *                   [--device N] [--precision fp16|bf16|fp32] [-v|-vv]
 *
 * --slat-ref bypasses upstream stages by loading
 * slat_dit_out_{coords,feats}.npy (or slat_gs_in_*) and runs only
 * SLAT-GS-decode + PLY write.
 */

#define STB_IMAGE_IMPLEMENTATION
#include "../../common/stb_image.h"

#define GS_PLY_WRITER_IMPLEMENTATION
#include "../../common/gs_ply_writer.h"

#define MARCHING_CUBES_IMPLEMENTATION
#include "../../common/marching_cubes.h"

#define STB_IMAGE_WRITE_IMPLEMENTATION
#define TINY_GLTF_IMPLEMENTATION
#include "../../common/tiny_gltf.h"

#define SAM3D_MESH_DECODER_IMPLEMENTATION
#include "../../common/sam3d_mesh_decoder.h"

#include "../../common/sam3d_xatlas.h"
#include "../../common/npy_io.h"
#include "cuda_sam3d_runner.h"

#include <float.h>
#include <math.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/wait.h>
#include <time.h>
#include <unistd.h>

enum {
    MESH_TEXTURE_COLOR_AUTO = 0,
    MESH_TEXTURE_COLOR_DECODER = 1,
    MESH_TEXTURE_COLOR_IMAGE = 2
};

typedef struct {
    float p[3];
    float rgb[3];
    int next;
} image_texel_point;

static int has_suffix(const char *s, const char *suffix)
{
    if (!s || !suffix) return 0;
    size_t ns = strlen(s), nx = strlen(suffix);
    return ns >= nx && strcmp(s + ns - nx, suffix) == 0;
}

static double cli_time_ms(void)
{
    struct timespec ts;
    clock_gettime(CLOCK_MONOTONIC, &ts);
    return (double)ts.tv_sec * 1000.0 + (double)ts.tv_nsec / 1.0e6;
}

static int write_mesh_file_rgb(const mc_mesh *mesh, const float *rgb,
                               const char *path, int texture_size,
                               int texture_use_xatlas)
{
    if (has_suffix(path, ".glb")) {
        if (rgb && texture_size > 0) {
            if (texture_use_xatlas) {
                sam3d_xatlas_mesh xm = {0};
                if (sam3d_xatlas_generate(mesh->vertices, mesh->n_verts,
                                          mesh->triangles, mesh->n_tris,
                                          texture_size, &xm) == 0) {
                    float *xrgb = (float *)malloc((size_t)xm.n_vertices *
                                                  3 * sizeof(float));
                    if (xrgb) {
                        for (int i = 0; i < xm.n_vertices; i++) {
                            uint32_t src = xm.xrefs[i];
                            xrgb[i * 3 + 0] = rgb[(size_t)src * 3 + 0];
                            xrgb[i * 3 + 1] = rgb[(size_t)src * 3 + 1];
                            xrgb[i * 3 + 2] = rgb[(size_t)src * 3 + 2];
                        }
                        int rc = tinygltf_write_glb_mesh_rgb_texture_indexed(
                            path, xm.positions, xrgb, xm.uvs, xm.n_vertices,
                            xm.indices, xm.n_indices, texture_size);
                        free(xrgb);
                        if (rc == 0) {
                            fprintf(stderr,
                                    "[test_cuda_sam3d] xatlas texture atlas: "
                                    "%d verts %d tris %d charts %dx%d\n",
                                    xm.n_vertices, xm.n_indices / 3,
                                    xm.chart_count, xm.atlas_width,
                                    xm.atlas_height);
                            sam3d_xatlas_free(&xm);
                            return 0;
                        }
                    }
                    sam3d_xatlas_free(&xm);
                }
                fprintf(stderr,
                        "[test_cuda_sam3d] xatlas texture bake failed; "
                        "falling back to triangle-grid atlas\n");
            }
            return tinygltf_write_glb_mesh_rgb_texture(path, mesh->vertices,
                                                       rgb, mesh->n_verts,
                                                       mesh->triangles,
                                                       mesh->n_tris,
                                                       texture_size);
        }
        return rgb ? tinygltf_write_glb_mesh_rgb(path, mesh->vertices, rgb,
                                                 mesh->n_verts,
                                                 mesh->triangles,
                                                 mesh->n_tris)
                   : tinygltf_write_glb_mesh(path, mesh->vertices,
                                             mesh->n_verts, mesh->triangles,
                                             mesh->n_tris);
    } else if (has_suffix(path, ".ply")) {
        return mc_write_ply(path, mesh);
    }
    return mc_write_obj(path, mesh);
}

static int write_mesh_file(const mc_mesh *mesh, const char *path)
{
    return write_mesh_file_rgb(mesh, NULL, path, 0, 1);
}

static int clampi(int v, int lo, int hi)
{
    return v < lo ? lo : (v > hi ? hi : v);
}

static float *project_image_rgb_to_mesh(const mc_mesh *mesh,
                                        const float *fallback_rgb,
                                        const uint8_t *pixels,
                                        int iw, int ih,
                                        const uint8_t *mask,
                                        int mw, int mh,
                                        const float *pmap,
                                        int pw, int ph,
                                        int *out_projected,
                                        int *out_points)
{
    if (out_projected) *out_projected = 0;
    if (out_points) *out_points = 0;
    if (!mesh || mesh->n_verts <= 0 || !mesh->vertices || !pixels ||
        iw <= 0 || ih <= 0 || !pmap || pw <= 0 || ph <= 0) {
        return NULL;
    }

    float mesh_min[3] = { FLT_MAX, FLT_MAX, FLT_MAX };
    float mesh_max[3] = {-FLT_MAX,-FLT_MAX,-FLT_MAX };
    for (int i = 0; i < mesh->n_verts; i++) {
        const float *p = mesh->vertices + (size_t)i * 3;
        for (int k = 0; k < 3; k++) {
            if (p[k] < mesh_min[k]) mesh_min[k] = p[k];
            if (p[k] > mesh_max[k]) mesh_max[k] = p[k];
        }
    }

    float pmin[3] = { FLT_MAX, FLT_MAX, FLT_MAX };
    float pmax[3] = {-FLT_MAX,-FLT_MAX,-FLT_MAX };
    int n_pts = 0;
    for (int y = 0; y < ph; y++) {
        for (int x = 0; x < pw; x++) {
            if (mask && mw > 0 && mh > 0) {
                int mx = clampi((int)(((float)x + 0.5f) * (float)mw / (float)pw), 0, mw - 1);
                int my = clampi((int)(((float)y + 0.5f) * (float)mh / (float)ph), 0, mh - 1);
                if (mask[(size_t)my * mw + mx] == 0) continue;
            }
            const float *q = pmap + ((size_t)y * pw + x) * 3;
            if (!isfinite(q[0]) || !isfinite(q[1]) || !isfinite(q[2])) continue;
            for (int k = 0; k < 3; k++) {
                if (q[k] < pmin[k]) pmin[k] = q[k];
                if (q[k] > pmax[k]) pmax[k] = q[k];
            }
            n_pts++;
        }
    }
    if (n_pts <= 0) return NULL;

