lighttransport/gemm/cuda/sam3d/test_cuda_sam3d.c
    image_texel_point *pts =
        (image_texel_point *)malloc((size_t)n_pts * sizeof(*pts));
    if (!pts) return NULL;

    int grid = 32;
    int nb = grid * grid * grid;
    int *head = (int *)malloc((size_t)nb * sizeof(int));
    if (!head) { free(pts); return NULL; }
    for (int i = 0; i < nb; i++) head[i] = -1;

    int pi = 0;
    for (int y = 0; y < ph; y++) {
        for (int x = 0; x < pw; x++) {
            if (mask && mw > 0 && mh > 0) {
                int mx = clampi((int)(((float)x + 0.5f) * (float)mw / (float)pw), 0, mw - 1);
                int my = clampi((int)(((float)y + 0.5f) * (float)mh / (float)ph), 0, mh - 1);
                if (mask[(size_t)my * mw + mx] == 0) continue;
            }
            const float *q = pmap + ((size_t)y * pw + x) * 3;
            if (!isfinite(q[0]) || !isfinite(q[1]) || !isfinite(q[2])) continue;

            image_texel_point *tp = &pts[pi];
            int cell[3];
            for (int k = 0; k < 3; k++) {
                float denom = pmax[k] - pmin[k];
                float t = (denom > 1e-12f) ? ((q[k] - pmin[k]) / denom) : 0.5f;
                if (t < 0.0f) t = 0.0f; else if (t > 1.0f) t = 1.0f;
                tp->p[k] = mesh_min[k] + t * (mesh_max[k] - mesh_min[k]);
                cell[k] = clampi((int)(t * (float)grid), 0, grid - 1);
            }

            int ix = clampi((int)(((float)x + 0.5f) * (float)iw / (float)pw), 0, iw - 1);
            int iy = clampi((int)(((float)y + 0.5f) * (float)ih / (float)ph), 0, ih - 1);
            const uint8_t *rgba = pixels + ((size_t)iy * iw + ix) * 4;
            tp->rgb[0] = (float)rgba[0] / 255.0f;
            tp->rgb[1] = (float)rgba[1] / 255.0f;
            tp->rgb[2] = (float)rgba[2] / 255.0f;

            int h = (cell[0] * grid + cell[1]) * grid + cell[2];
            tp->next = head[h];
            head[h] = pi;
            pi++;
        }
    }
    n_pts = pi;
    if (out_points) *out_points = n_pts;
    if (n_pts <= 0) { free(head); free(pts); return NULL; }

    float *out = (float *)malloc((size_t)mesh->n_verts * 3 * sizeof(float));
    if (!out) { free(head); free(pts); return NULL; }
    if (fallback_rgb) {
        memcpy(out, fallback_rgb, (size_t)mesh->n_verts * 3 * sizeof(float));
    } else {
        for (int i = 0; i < mesh->n_verts * 3; i++) out[i] = 0.8f;
    }

    int projected = 0;
    int max_search_radius = grid - 1;
    for (int vi = 0; vi < mesh->n_verts; vi++) {
        const float *vp = mesh->vertices + (size_t)vi * 3;
        int vc[3];
        for (int k = 0; k < 3; k++) {
            float denom = mesh_max[k] - mesh_min[k];
            float t = (denom > 1e-12f) ? ((vp[k] - mesh_min[k]) / denom) : 0.5f;
            if (t < 0.0f) t = 0.0f; else if (t > 1.0f) t = 1.0f;
            vc[k] = clampi((int)(t * (float)grid), 0, grid - 1);
        }
        float best_d2 = FLT_MAX;
        int best = -1;
        for (int r = 0; r <= max_search_radius && best < 0; r++) {
            for (int dz = -r; dz <= r; dz++) {
                int cz = vc[0] + dz;
                if (cz < 0 || cz >= grid) continue;
                for (int dy = -r; dy <= r; dy++) {
                    int cy = vc[1] + dy;
                    if (cy < 0 || cy >= grid) continue;
                    for (int dx = -r; dx <= r; dx++) {
                        int cx = vc[2] + dx;
                        if (cx < 0 || cx >= grid) continue;
                        int h = (cz * grid + cy) * grid + cx;
                        for (int pidx = head[h]; pidx >= 0; pidx = pts[pidx].next) {
                            float d0 = vp[0] - pts[pidx].p[0];
                            float d1 = vp[1] - pts[pidx].p[1];
                            float d2 = vp[2] - pts[pidx].p[2];
                            float dd = d0*d0 + d1*d1 + d2*d2;
                            if (dd < best_d2) {
                                best_d2 = dd;
                                best = pidx;
                            }
                        }
                    }
                }
            }
        }
        if (best >= 0) {
            out[(size_t)vi * 3 + 0] = pts[best].rgb[0];
            out[(size_t)vi * 3 + 1] = pts[best].rgb[1];
            out[(size_t)vi * 3 + 2] = pts[best].rgb[2];
            projected++;
        }
    }

    if (out_projected) *out_projected = projected;
    free(head);
    free(pts);
    return out;
}

static int write_occupancy_mesh(cuda_sam3d_ctx *ctx, const char *path,
                                float iso)
{
    if (!ctx || !path) return -1;
    int dims[3] = {0, 0, 0};
    if (cuda_sam3d_get_occupancy(ctx, NULL, dims) != 0 ||
        dims[0] <= 1 || dims[1] <= 1 || dims[2] <= 1) {
        fprintf(stderr, "[test_cuda_sam3d] mesh export needs occupancy\n");
        return -1;
    }
    size_t n = (size_t)dims[0] * dims[1] * dims[2];
    float *occ = (float *)malloc(n * sizeof(float));
    if (!occ) return -1;
    if (cuda_sam3d_get_occupancy(ctx, occ, NULL) != 0) {
        free(occ);
        return -1;
    }
    float bounds[6] = {0.0f, 0.0f, 0.0f, 1.0f, 1.0f, 1.0f};
    mc_mesh mesh = mc_marching_cubes(occ, dims[0], dims[1], dims[2],
                                     iso, bounds);
    free(occ);
    if (mesh.n_verts <= 0 || mesh.n_tris <= 0) {
        fprintf(stderr, "[test_cuda_sam3d] mesh extraction produced no faces at iso=%g\n",
                iso);
        mc_mesh_free(&mesh);
        return -1;
    }

    int rc = write_mesh_file(&mesh, path);
    if (rc == 0) {
        fprintf(stderr, "[test_cuda_sam3d] wrote mesh %d verts %d tris to %s\n",
                mesh.n_verts, mesh.n_tris, path);
    } else {
        fprintf(stderr, "[test_cuda_sam3d] mesh write failed: %s\n", path);
    }
    mc_mesh_free(&mesh);
    return rc;
}

static int write_learned_mesh(cuda_sam3d_ctx *ctx, const char *decoder_path,
                              const char *path, int n_threads,
                              int texture_size, int texture_use_xatlas,
                              int texture_color_mode,
                              const uint8_t *pixels, int iw, int ih,
                              const uint8_t *mask, int mw, int mh,
                              const float *pmap, int pw, int ph)
{
    if (!ctx || !decoder_path || !path) return -1;
    int N = 0, C = 0;
    if (cuda_sam3d_get_slat_tokens(ctx, NULL, NULL, &N, &C) != 0 ||
        N <= 0 || C != 8) {
        fprintf(stderr, "[test_cuda_sam3d] learned mesh export needs SLAT tokens (N=%d C=%d)\n",
                N, C);
        return -1;
    }
    float *feats = (float *)malloc((size_t)N * C * sizeof(float));
    int32_t *coords = (int32_t *)malloc((size_t)N * 4 * sizeof(int32_t));
    if (!feats || !coords) { free(feats); free(coords); return -1; }
    if (cuda_sam3d_get_slat_tokens(ctx, feats, coords, NULL, NULL) != 0) {
        free(feats); free(coords); return -1;
    }
    sam3d_mesh_decoder_model *dec =
        sam3d_mesh_decoder_load_safetensors(decoder_path);
    if (!dec) {
        fprintf(stderr, "[test_cuda_sam3d] cannot load mesh decoder: %s\n",
                decoder_path);
        free(feats); free(coords); return -1;
    }
    mc_mesh mesh = {0};
    float *rgb = NULL;
    int rc = sam3d_mesh_decoder_decode_rgb(dec, coords, feats, N, C, &mesh,
                                           &rgb, n_threads);
    sam3d_mesh_decoder_free(dec);
    free(feats); free(coords);
    if (rc != 0 || mesh.n_verts <= 0 || mesh.n_tris <= 0) {
        fprintf(stderr, "[test_cuda_sam3d] learned mesh extraction failed\n");
        mc_mesh_free(&mesh);
        free(rgb);
        return -1;
    }
    float *write_rgb = rgb;
    float *projected_rgb = NULL;
    if (texture_color_mode != MESH_TEXTURE_COLOR_DECODER) {
        int projected = 0, source_points = 0;
        projected_rgb = project_image_rgb_to_mesh(&mesh, rgb, pixels, iw, ih,
                                                  mask, mw, mh, pmap, pw, ph,
                                                  &projected, &source_points);
        if (projected_rgb && projected > 0) {
            write_rgb = projected_rgb;
            fprintf(stderr,
                    "[test_cuda_sam3d] source-image mesh colors: "
                    "%d/%d vertices from %d pointmap texels%s\n",
                    projected, mesh.n_verts, source_points,
                    texture_color_mode == MESH_TEXTURE_COLOR_AUTO ?
                        " (auto)" : "");
        } else if (texture_color_mode == MESH_TEXTURE_COLOR_IMAGE) {
            fprintf(stderr,
                    "[test_cuda_sam3d] source-image mesh colors unavailable; "
                    "falling back to decoder RGB\n");
        }
    }

    rc = write_mesh_file_rgb(&mesh, write_rgb, path, texture_size,
                             texture_use_xatlas);
    if (rc == 0) {
        fprintf(stderr, "[test_cuda_sam3d] wrote learned mesh %d verts %d tris%s%s to %s\n",
                mesh.n_verts, mesh.n_tris, write_rgb ? " with vertex RGB" : "",
                (write_rgb && texture_size > 0 && has_suffix(path, ".glb")) ?
                    " baked texture" : "",
                path);
    } else {
        fprintf(stderr, "[test_cuda_sam3d] learned mesh write failed: %s\n", path);
    }
    mc_mesh_free(&mesh);
    free(projected_rgb);
    free(rgb);
    return rc;
}

static int file_exists(const char *path)
{
    FILE *f = path ? fopen(path, "rb") : NULL;
    if (!f) return 0;
    fclose(f);
    return 1;
}

static const char *first_existing_path(const char **paths)
{
    for (int i = 0; paths && paths[i]; i++) {
        if (file_exists(paths[i])) return paths[i];
    }
    return NULL;
}

