lighttransport/gemm/cuda/sam3d/test_cuda_sam3d.c
static int run_moge_pointmap(const char *python, const char *script,
                             const char *image, const char *out,
                             const char *model, const char *device)
{
    if (!python || !script || !image || !out || !model || !device) return -1;
    fprintf(stderr, "[test_cuda_sam3d] generating MoGe pointmap: %s\n", out);
    pid_t pid = fork();
    if (pid < 0) {
        perror("fork");
        return -1;
    }
    if (pid == 0) {
        char *const argv[] = {
            (char *)python,
            (char *)script,
            (char *)"--image", (char *)image,
            (char *)"--out", (char *)out,
            (char *)"--model", (char *)model,
            (char *)"--device", (char *)device,
            NULL
        };
        execvp(python, argv);
        perror("execvp");
        _exit(127);
    }
    int status = 0;
    if (waitpid(pid, &status, 0) < 0) {
        perror("waitpid");
        return -1;
    }
    if (!WIFEXITED(status) || WEXITSTATUS(status) != 0) {
        fprintf(stderr, "[test_cuda_sam3d] MoGe pointmap failed (status=%d)\n",
                status);
        return -1;
    }
    return 0;
}

int main(int argc, char **argv)
{
    const double t_main0 = cli_time_ms();
    double t_decode_image_ms = 0.0, t_decode_mask_ms = 0.0;
    double t_moge_ms = 0.0, t_load_pointmap_ms = 0.0;
    double t_create_ms = 0.0, t_set_inputs_ms = 0.0;
    double t_mesh_ms = 0.0, t_ply_write_ms = 0.0;
    cuda_sam3d_config cfg = {0};
    cfg.device_ordinal = 0;
    cfg.verbose        = 0;
    cfg.precision      = "fp16";
    cfg.seed           = 42;
    cfg.ss_steps       = 2;
    cfg.slat_steps     = 12;
    cfg.cfg_scale      = 2.0f;

    const char *image_path    = NULL;
    const char *mask_path     = NULL;
    const char *pointmap_path = NULL;
    const char *slat_ref_dir  = NULL;
    const char *out_path      = "splat.ply";
    const char *mesh_out_path = NULL;
    const char *mesh_dec_path = NULL;
    float mesh_iso = 0.0f;
    int mesh_only = 0;
    int mesh_source_slat = 0;
    int mesh_threads = 4;
    int mesh_texture_size = 0;
    int mesh_texture_use_xatlas = 1;
    int mesh_texture_color_mode = MESH_TEXTURE_COLOR_AUTO;
    int use_moge = 0;
    const char *moge_python = NULL;
    const char *moge_script = NULL;
    const char *moge_model = NULL;
    const char *moge_device = "cpu";
    const char *moge_out_path = NULL;

    int positional = 0;
    for (int i = 1; i < argc; i++) {
        const char *a = argv[i];
        if      (!strcmp(a, "--safetensors-dir") && i+1 < argc) cfg.safetensors_dir = argv[++i];
        else if (!strcmp(a, "--pipeline-yaml")   && i+1 < argc) cfg.pipeline_yaml   = argv[++i];
        else if (!strcmp(a, "--device")          && i+1 < argc) cfg.device_ordinal  = atoi(argv[++i]);
        else if (!strcmp(a, "--precision")       && i+1 < argc) cfg.precision       = argv[++i];
        else if (!strcmp(a, "--pointmap")        && i+1 < argc) pointmap_path       = argv[++i];
        else if (!strcmp(a, "--slat-ref")        && i+1 < argc) slat_ref_dir        = argv[++i];
        else if (!strcmp(a, "--seed")            && i+1 < argc) cfg.seed            = strtoull(argv[++i], NULL, 10);
        else if (!strcmp(a, "--steps")           && i+1 < argc) cfg.ss_steps        = atoi(argv[++i]);
        else if (!strcmp(a, "--slat-steps")      && i+1 < argc) cfg.slat_steps      = atoi(argv[++i]);
        else if (!strcmp(a, "--cfg")             && i+1 < argc) cfg.cfg_scale       = strtof(argv[++i], NULL);
        else if (!strcmp(a, "-o")                && i+1 < argc) out_path            = argv[++i];
        else if (!strcmp(a, "--mesh-out")        && i+1 < argc) mesh_out_path       = argv[++i];
        else if (!strcmp(a, "--mesh-decoder")    && i+1 < argc) { mesh_dec_path     = argv[++i]; mesh_source_slat = 1; }
        else if (!strcmp(a, "--mesh-source")     && i+1 < argc) {
            const char *v = argv[++i];
            if (!strcmp(v, "slat")) mesh_source_slat = 1;
            else if (!strcmp(v, "occupancy")) mesh_source_slat = 0;
            else { fprintf(stderr, "unknown --mesh-source: %s\n", v); return 2; }
        }
        else if (!strcmp(a, "--mesh-iso")        && i+1 < argc) mesh_iso            = strtof(argv[++i], NULL);
        else if (!strcmp(a, "--mesh-only"))                     mesh_only           = 1;
        else if (!strcmp(a, "--mesh-threads")    && i+1 < argc) mesh_threads        = atoi(argv[++i]);
        else if (!strcmp(a, "--mesh-texture-size") && i+1 < argc) mesh_texture_size = atoi(argv[++i]);
        else if (!strcmp(a, "--mesh-texture-mode") && i+1 < argc) {
            const char *v = argv[++i];
            if (!strcmp(v, "xatlas")) mesh_texture_use_xatlas = 1;
            else if (!strcmp(v, "grid")) mesh_texture_use_xatlas = 0;
            else { fprintf(stderr, "unknown --mesh-texture-mode: %s\n", v); return 2; }
        }
        else if (!strcmp(a, "--mesh-texture-color") && i+1 < argc) {
            const char *v = argv[++i];
            if (!strcmp(v, "auto")) mesh_texture_color_mode = MESH_TEXTURE_COLOR_AUTO;
            else if (!strcmp(v, "decoder")) mesh_texture_color_mode = MESH_TEXTURE_COLOR_DECODER;
            else if (!strcmp(v, "image")) mesh_texture_color_mode = MESH_TEXTURE_COLOR_IMAGE;
            else { fprintf(stderr, "unknown --mesh-texture-color: %s\n", v); return 2; }
        }
        else if (!strcmp(a, "--moge"))                          use_moge            = 1;
        else if (!strcmp(a, "--moge-python")     && i+1 < argc) { moge_python       = argv[++i]; use_moge = 1; }
        else if (!strcmp(a, "--moge-script")     && i+1 < argc) { moge_script       = argv[++i]; use_moge = 1; }
        else if (!strcmp(a, "--moge-model")      && i+1 < argc) { moge_model        = argv[++i]; use_moge = 1; }
        else if (!strcmp(a, "--moge-device")     && i+1 < argc) { moge_device       = argv[++i]; use_moge = 1; }
        else if (!strcmp(a, "--moge-out")        && i+1 < argc) { moge_out_path     = argv[++i]; use_moge = 1; }
        else if (!strcmp(a, "-v"))                              cfg.verbose         = 1;
        else if (!strcmp(a, "-vv"))                             cfg.verbose         = 2;
        else if (a[0] != '-') {
            if      (positional == 0) image_path = a;
            else if (positional == 1) mask_path  = a;
            positional++;
        } else {
            fprintf(stderr, "unknown arg: %s\n", a);
            fprintf(stderr,
                    "Usage: %s [--safetensors-dir DIR | --pipeline-yaml YAML] "
                    "<image.png> <mask.png> "
                    "[--pointmap pmap.npy] [--slat-ref <dir>] "
                    "[--seed N] [--steps N] [--slat-steps N] [--cfg F] "
                    "[-o splat.ply] [--mesh-out mesh.obj|mesh.ply|mesh.glb] "
                    "[--mesh-source occupancy|slat] [--mesh-decoder mesh.st] "
                    "[--mesh-iso F] [--mesh-only] [--mesh-threads N] "
                    "[--mesh-texture-size N] "
                    "[--mesh-texture-mode xatlas|grid] "
                    "[--mesh-texture-color auto|decoder|image] "
                    "[--moge] [--moge-out pmap.npy] "
                    "[--moge-python PY] [--moge-script SCRIPT] "
                    "[--moge-model MODEL] [--moge-device cpu|cuda] "
                    "[--device N] [--precision fp16|bf16|fp32] "
                    "[-v|-vv]\n",
                    argv[0]);
            return 2;
        }
    }
    if (!mesh_out_path && has_suffix(out_path, ".glb")) {
        mesh_out_path = out_path;
        mesh_only = 1;
    }
    char default_mesh_dec[1024];
    if (!mesh_dec_path && cfg.safetensors_dir) {
        snprintf(default_mesh_dec, sizeof(default_mesh_dec),
                 "%s/sam3d_slat_mesh_decoder.safetensors",
                 cfg.safetensors_dir);
        if (file_exists(default_mesh_dec)) {
            mesh_dec_path = default_mesh_dec;
            mesh_source_slat = 1;
        }
    }
    if (mesh_threads <= 0) mesh_threads = 1;
    if (mesh_texture_size < 0) mesh_texture_size = 0;

    const char *moge_python_candidates[] = {
        "ref/sam3d/.venv/bin/python",
        "../../ref/sam3d/.venv/bin/python",
        NULL
    };
    const char *moge_script_candidates[] = {
        "ref/sam3d/moge_pointmap.py",
        "../../ref/sam3d/moge_pointmap.py",
        NULL
    };
    if (!moge_python) {
        const char *p = first_existing_path(moge_python_candidates);
        moge_python = p ? p : "python3";
    }
    if (!moge_script) moge_script = first_existing_path(moge_script_candidates);
    if (!moge_model) {
        moge_model = file_exists("/mnt/disk01/models/moge-vitl/model.pt") ?
            "/mnt/disk01/models/moge-vitl/model.pt" : "Ruicheng/moge-vitl";
    }

    if (!cfg.safetensors_dir && !cfg.pipeline_yaml) {
        fprintf(stderr,
                "[test_cuda_sam3d] need --safetensors-dir or --pipeline-yaml.\n"
                "  Default layout: $MODELS/sam3d/safetensors/ next to "
                "$MODELS/sam3d/checkpoints/pipeline.yaml\n");
        return 2;
    }
    if (!slat_ref_dir && (!image_path || !mask_path)) {
        fprintf(stderr,
                "[test_cuda_sam3d] need <image.png> <mask.png> "
                "(or --slat-ref <dir> to bypass upstream).\n");
        return 2;
    }

