lighttransport/gemm/cuda/sam3d/test_cuda_sam3d.c
    /* Load image (force 4 channels, RGBA). */
    int iw = 0, ih = 0, ichan = 0;
    uint8_t *pixels = NULL;
    if (image_path) {
        double t0 = cli_time_ms();
        pixels = stbi_load(image_path, &iw, &ih, &ichan, 4);
        t_decode_image_ms = cli_time_ms() - t0;
        if (!pixels) { fprintf(stderr, "cannot decode %s\n", image_path); return 3; }
    }

    /* Load mask (grayscale). */
    int mw = 0, mh = 0, mchan = 0;
    uint8_t *mpix = NULL;
    if (mask_path) {
        double t0 = cli_time_ms();
        mpix = stbi_load(mask_path, &mw, &mh, &mchan, 1);
        t_decode_mask_ms = cli_time_ms() - t0;
        if (!mpix) {
            fprintf(stderr, "cannot decode %s\n", mask_path);
            stbi_image_free(pixels); return 3;
        }
    }

    char generated_pointmap_path[1024] = {0};
    int generated_pointmap_temp = 0;
    if (!pointmap_path && use_moge) {
        if (!image_path) {
            fprintf(stderr, "[test_cuda_sam3d] --moge needs an input image\n");
            stbi_image_free(pixels); stbi_image_free(mpix);
            return 4;
        }
        if (!moge_script) {
            fprintf(stderr,
                    "[test_cuda_sam3d] cannot find ref/sam3d/moge_pointmap.py; "
                    "pass --moge-script\n");
            stbi_image_free(pixels); stbi_image_free(mpix);
            return 4;
        }
        if (moge_out_path) {
            pointmap_path = moge_out_path;
        } else {
            snprintf(generated_pointmap_path, sizeof(generated_pointmap_path),
                     "/tmp/sam3d_moge_pointmap_%ld.npy", (long)getpid());
            pointmap_path = generated_pointmap_path;
            generated_pointmap_temp = 1;
        }
        double t0 = cli_time_ms();
        if (run_moge_pointmap(moge_python, moge_script, image_path,
                              pointmap_path, moge_model, moge_device) != 0) {
            stbi_image_free(pixels); stbi_image_free(mpix);
            return 4;
        }
        t_moge_ms = cli_time_ms() - t0;
    }

    /* Optional pointmap. Use --moge to generate one with the Python MoGe helper. */
    float *pmap = NULL;
    int pmap_dims[8] = {0}, pmap_ndim = 0, pmap_is_f32 = 0;
    if (pointmap_path) {
        double t0 = cli_time_ms();
        pmap = (float *)npy_load(pointmap_path, &pmap_ndim, pmap_dims, &pmap_is_f32);
        t_load_pointmap_ms = cli_time_ms() - t0;
        if (!pmap || !pmap_is_f32 || pmap_ndim != 3 || pmap_dims[2] != 3) {
            fprintf(stderr, "pointmap must be (H, W, 3) f32; got ndim=%d\n", pmap_ndim);
            free(pmap); stbi_image_free(pixels); stbi_image_free(mpix);
            return 4;
        }
    }

    double t0 = cli_time_ms();
    cuda_sam3d_ctx *ctx = cuda_sam3d_create(&cfg);
    t_create_ms = cli_time_ms() - t0;
    if (!ctx) {
        fprintf(stderr, "[test_cuda_sam3d] cuda_sam3d_create failed\n");
        stbi_image_free(pixels); stbi_image_free(mpix); free(pmap);
        return 5;
    }

    t0 = cli_time_ms();
    if (pixels && cuda_sam3d_set_image_rgba(ctx, pixels, iw, ih) != 0) {
        fprintf(stderr, "set image failed\n");
        cuda_sam3d_destroy(ctx); stbi_image_free(pixels); stbi_image_free(mpix); free(pmap);
        return 5;
    }
    if (mpix && cuda_sam3d_set_mask(ctx, mpix, mw, mh) != 0) {
        fprintf(stderr, "set mask failed\n");
        cuda_sam3d_destroy(ctx); stbi_image_free(pixels); stbi_image_free(mpix); free(pmap);
        return 5;
    }
    if (pmap && cuda_sam3d_set_pointmap(ctx, pmap, pmap_dims[1], pmap_dims[0]) != 0) {
        fprintf(stderr, "set pointmap failed\n");
        cuda_sam3d_destroy(ctx); stbi_image_free(pixels); stbi_image_free(mpix); free(pmap);
        return 5;
    }
    t_set_inputs_ms = cli_time_ms() - t0;

    int rc = 0;
    int32_t *slat_coords = NULL;
    float   *slat_feats  = NULL;

    if (slat_ref_dir) {
        char pbuf[1536];
        int nd = 0, dims[8] = {0}, is_f32 = 0;
        const char *names_c[2] = { "slat_gs_in_coords.npy", "slat_dit_out_coords.npy" };
        const char *names_f[2] = { "slat_gs_in_feats.npy",  "slat_dit_out_feats.npy"  };
        for (int k = 0; k < 2 && !slat_coords; k++) {
            snprintf(pbuf, sizeof(pbuf), "%s/%s", slat_ref_dir, names_c[k]);
            slat_coords = (int32_t *)npy_load(pbuf, &nd, dims, &is_f32);
        }
        if (!slat_coords || nd != 2 || dims[1] != 4) {
            fprintf(stderr, "--slat-ref: cannot read slat_*_coords.npy from %s\n",
                    slat_ref_dir);
            rc = 6; goto cleanup;
        }
        int N = dims[0];
        for (int k = 0; k < 2 && !slat_feats; k++) {
            snprintf(pbuf, sizeof(pbuf), "%s/%s", slat_ref_dir, names_f[k]);
            slat_feats = (float *)npy_load(pbuf, &nd, dims, &is_f32);
        }
        if (!slat_feats || !is_f32 || nd != 2 || dims[0] != N) {
            fprintf(stderr, "--slat-ref: cannot read slat_*_feats.npy from %s\n",
                    slat_ref_dir);
            rc = 6; goto cleanup;
        }
        int C = dims[1];
        if (cuda_sam3d_debug_override_slat(ctx, slat_feats, slat_coords, N, C) != 0) {
            fprintf(stderr, "--slat-ref: override failed\n");
            rc = 7; goto cleanup;
        }
        fprintf(stderr, "[test_cuda_sam3d] --slat-ref: loaded N=%d C=%d\n", N, C);
        if (mesh_out_path && mesh_source_slat) {
            if (!mesh_dec_path) {
                fprintf(stderr, "[test_cuda_sam3d] --mesh-source slat needs --mesh-decoder\n");
                rc = 10; goto cleanup;
            }
            t0 = cli_time_ms();
            if (write_learned_mesh(ctx, mesh_dec_path, mesh_out_path,
                                   mesh_threads, mesh_texture_size,
                                   mesh_texture_use_xatlas,
                                   mesh_texture_color_mode,
                                   pixels, iw, ih, mpix, mw, mh,
                                   pmap, pmap_dims[1], pmap_dims[0]) != 0) {
                rc = 10; goto cleanup;
            }
            t_mesh_ms += cli_time_ms() - t0;
            if (mesh_only) goto cleanup;
        }
    } else {
        if ((rc = cuda_sam3d_run_dinov2(ctx))     != 0) { fprintf(stderr, "dinov2 rc=%d\n",     rc); goto cleanup; }
        if ((rc = cuda_sam3d_run_cond_fuser(ctx)) != 0) { fprintf(stderr, "cond_fuser rc=%d\n", rc); goto cleanup; }
        if ((rc = cuda_sam3d_run_ss_dit(ctx))     != 0) { fprintf(stderr, "ss_dit rc=%d\n",     rc); goto cleanup; }
        if ((rc = cuda_sam3d_run_ss_decode(ctx))  != 0) { fprintf(stderr, "ss_decode rc=%d\n",  rc); goto cleanup; }
        if (mesh_out_path && !mesh_source_slat) {
            t0 = cli_time_ms();
            if (write_occupancy_mesh(ctx, mesh_out_path, mesh_iso) != 0) {
                rc = 10; goto cleanup;
            }
            t_mesh_ms += cli_time_ms() - t0;
            if (mesh_only) goto cleanup;
        }
        if ((rc = cuda_sam3d_run_slat_dit(ctx))   != 0) { fprintf(stderr, "slat_dit rc=%d\n",   rc); goto cleanup; }
        if (mesh_out_path && mesh_source_slat) {
            if (!mesh_dec_path) {
                fprintf(stderr, "[test_cuda_sam3d] --mesh-source slat needs --mesh-decoder\n");
                rc = 10; goto cleanup;
            }
            t0 = cli_time_ms();
            if (write_learned_mesh(ctx, mesh_dec_path, mesh_out_path,
                                   mesh_threads, mesh_texture_size,
                                   mesh_texture_use_xatlas,
                                   mesh_texture_color_mode,
                                   pixels, iw, ih, mpix, mw, mh,
                                   pmap, pmap_dims[1], pmap_dims[0]) != 0) {
                rc = 10; goto cleanup;
            }
            t_mesh_ms += cli_time_ms() - t0;
            if (mesh_only) goto cleanup;
        }
    }

    if (mesh_only) {
        fprintf(stderr, "[test_cuda_sam3d] --mesh-only needs --mesh-out\n");
        rc = 10; goto cleanup;
    }
    if ((rc = cuda_sam3d_run_slat_gs_decode(ctx)) != 0) {
        fprintf(stderr, "slat_gs_decode rc=%d\n", rc); goto cleanup;
    }

    int n_gauss = 0;
    if (cuda_sam3d_get_gaussians(ctx, NULL, &n_gauss) != 0 || n_gauss <= 0) {
        fprintf(stderr, "no gaussians produced\n"); rc = 8; goto cleanup;
    }
    float *gaussians = (float *)malloc((size_t)n_gauss * CUDA_SAM3D_GS_STRIDE * sizeof(float));
    if (!gaussians || cuda_sam3d_get_gaussians(ctx, gaussians, NULL) != 0) {
        fprintf(stderr, "get_gaussians failed\n"); free(gaussians); rc = 8; goto cleanup;
    }

    t0 = cli_time_ms();
    if (gs_ply_write_rows(out_path, n_gauss, gaussians,
                          CUDA_SAM3D_GS_STRIDE) != 0) {
        fprintf(stderr, "gs_ply_write failed\n"); rc = 9;
    } else {
        fprintf(stderr, "[test_cuda_sam3d] wrote %d gaussians to %s\n", n_gauss, out_path);
    }
    t_ply_write_ms = cli_time_ms() - t0;
    free(gaussians);

cleanup:
    if (cfg.verbose && ctx) {
        cuda_sam3d_profile p = {0};
        if (cuda_sam3d_get_profile(ctx, &p) == 0) {
            fprintf(stderr,
                    "[test_cuda_sam3d][timing] total %.3f ms "
                    "(decode image %.3f mask %.3f, moge %.3f, pmap %.3f, "
                    "create %.3f, set_inputs %.3f, mesh %.3f, ply %.3f)\n",
                    cli_time_ms() - t_main0, t_decode_image_ms,
                    t_decode_mask_ms, t_moge_ms, t_load_pointmap_ms,
                    t_create_ms, t_set_inputs_ms, t_mesh_ms,
                    t_ply_write_ms);
            fprintf(stderr,
                    "[test_cuda_sam3d][timing] stages: dinov2 %.3f, "
                    "cond_fuser %.3f, ss_dit %.3f, ss_decode %.3f, "
                    "slat_dit %.3f, slat_gs %.3f ms "
                    "(dinov2_tokens=%d cond_tokens=%d active_voxels=%d "
                    "gaussians=%d ss_steps=%d slat_steps=%d cfg_steps=%d)\n",
                    p.dinov2_ms, p.cond_fuser_ms, p.ss_dit_ms,
                    p.ss_decode_ms, p.slat_dit_ms, p.slat_gs_ms,
                    p.dinov2_tokens, p.cond_tokens, p.active_voxels,
                    p.gaussians, p.ss_steps, p.slat_steps, p.cfg_steps);
        }
    }
    cuda_sam3d_destroy(ctx);
    stbi_image_free(pixels);
    stbi_image_free(mpix);
    free(pmap);
    free(slat_coords); free(slat_feats);
    if (generated_pointmap_temp && generated_pointmap_path[0]) {
        unlink(generated_pointmap_path);
    }
    return rc;
}
